<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Список поддерживаемых языков
    |--------------------------------------------------------------------------
    | 
    | "короткоеНаименование" => "Полное название языка"
    | Например 'ru' => 'Русский'
    |
    | Язык по умолчанию можно установить в app.locale
    | 
    */
    'locales' => [
        'ru' => 'Русский',
        'en' => 'English',
    ],

    
    /*
    |--------------------------------------------------------------------------
    | Templates
    |--------------------------------------------------------------------------
    | 
    | module.templates => Name template
    | /views/{module}/{templates}/*.blade.php
    | 
    */
    'templates' => [
        'catalog.catalog' => 'Каталог товаров',
        'catalog.catalog2' => 'Каталог товаров 2',
        'catalog.catalog3' => 'Каталог товаров 3',
        'catalog.catalog4' => 'Каталог товаров 4',
        'catalog.catalog5' => 'Каталог товаров 5',
        'gallery.gallery' => 'Галерея',
        'form.contacts' => 'Контактная форма',
    ],

    
    /*
    |--------------------------------------------------------------------------
    | Modules
    |--------------------------------------------------------------------------
    | 
    | Настройка модулей
    | 
    */
    'modules' => [
        
        'catalog' => [
            'as' => 'CatalogController',
            'currency' => ['RUB', 'USD', 'EUR']
        ],
        
    ],
    
];